/* automatically generated by rust-bindgen */

// Generated using:
// bindgen 0.51.0
// macOS SDK 10.14.

use core_foundation_sys::array::CFArrayRef;
use core_foundation_sys::base::{Boolean, CFAllocatorRef, CFIndex, CFTypeID};
use core_foundation_sys::dictionary::CFDictionaryRef;
use core_foundation_sys::propertylist::CFPropertyListRef;
use core_foundation_sys::runloop::CFRunLoopSourceRef;
use core_foundation_sys::string::CFStringRef;

use dispatch_queue_t;

#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __SCDynamicStore {
    _unused: [u8; 0],
}
pub type SCDynamicStoreRef = *const __SCDynamicStore;
#[repr(C)]
pub struct SCDynamicStoreContext {
    pub version: CFIndex,
    pub info: *mut ::libc::c_void,
    pub retain: ::core::option::Option<
        unsafe extern "C" fn(info: *const ::libc::c_void) -> *const ::libc::c_void,
    >,
    pub release: ::core::option::Option<unsafe extern "C" fn(info: *const ::libc::c_void)>,
    pub copyDescription:
        ::core::option::Option<unsafe extern "C" fn(info: *const ::libc::c_void) -> CFStringRef>,
}
#[test]
fn bindgen_test_layout_SCDynamicStoreContext() {
    assert_eq!(
        ::core::mem::size_of::<SCDynamicStoreContext>(),
        40usize,
        concat!("Size of: ", stringify!(SCDynamicStoreContext))
    );
    assert_eq!(
        ::core::mem::align_of::<SCDynamicStoreContext>(),
        8usize,
        concat!("Alignment of ", stringify!(SCDynamicStoreContext))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCDynamicStoreContext>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCDynamicStoreContext),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCDynamicStoreContext>())).info as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SCDynamicStoreContext),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCDynamicStoreContext>())).retain as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SCDynamicStoreContext),
            "::",
            stringify!(retain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCDynamicStoreContext>())).release as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SCDynamicStoreContext),
            "::",
            stringify!(release)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SCDynamicStoreContext>())).copyDescription as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SCDynamicStoreContext),
            "::",
            stringify!(copyDescription)
        )
    );
}
pub type SCDynamicStoreCallBack = ::core::option::Option<
    unsafe extern "C" fn(
        store: SCDynamicStoreRef,
        changedKeys: CFArrayRef,
        info: *mut ::libc::c_void,
    ),
>;
extern "C" {
    pub fn SCDynamicStoreGetTypeID() -> CFTypeID;
}
extern "C" {
    pub fn SCDynamicStoreCreate(
        allocator: CFAllocatorRef,
        name: CFStringRef,
        callout: SCDynamicStoreCallBack,
        context: *mut SCDynamicStoreContext,
    ) -> SCDynamicStoreRef;
}
extern "C" {
    pub fn SCDynamicStoreCreateWithOptions(
        allocator: CFAllocatorRef,
        name: CFStringRef,
        storeOptions: CFDictionaryRef,
        callout: SCDynamicStoreCallBack,
        context: *mut SCDynamicStoreContext,
    ) -> SCDynamicStoreRef;
}
extern "C" {
    pub static kSCDynamicStoreUseSessionKeys: CFStringRef;
}
extern "C" {
    pub fn SCDynamicStoreCreateRunLoopSource(
        allocator: CFAllocatorRef,
        store: SCDynamicStoreRef,
        order: CFIndex,
    ) -> CFRunLoopSourceRef;
}
extern "C" {
    pub fn SCDynamicStoreSetDispatchQueue(
        store: SCDynamicStoreRef,
        queue: dispatch_queue_t,
    ) -> Boolean;
}
extern "C" {
    pub fn SCDynamicStoreCopyKeyList(store: SCDynamicStoreRef, pattern: CFStringRef) -> CFArrayRef;
}
extern "C" {
    pub fn SCDynamicStoreAddValue(
        store: SCDynamicStoreRef,
        key: CFStringRef,
        value: CFPropertyListRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCDynamicStoreAddTemporaryValue(
        store: SCDynamicStoreRef,
        key: CFStringRef,
        value: CFPropertyListRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCDynamicStoreCopyValue(store: SCDynamicStoreRef, key: CFStringRef)
        -> CFPropertyListRef;
}
extern "C" {
    pub fn SCDynamicStoreCopyMultiple(
        store: SCDynamicStoreRef,
        keys: CFArrayRef,
        patterns: CFArrayRef,
    ) -> CFDictionaryRef;
}
extern "C" {
    pub fn SCDynamicStoreSetValue(
        store: SCDynamicStoreRef,
        key: CFStringRef,
        value: CFPropertyListRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCDynamicStoreSetMultiple(
        store: SCDynamicStoreRef,
        keysToSet: CFDictionaryRef,
        keysToRemove: CFArrayRef,
        keysToNotify: CFArrayRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCDynamicStoreRemoveValue(store: SCDynamicStoreRef, key: CFStringRef) -> Boolean;
}
extern "C" {
    pub fn SCDynamicStoreNotifyValue(store: SCDynamicStoreRef, key: CFStringRef) -> Boolean;
}
extern "C" {
    pub fn SCDynamicStoreSetNotificationKeys(
        store: SCDynamicStoreRef,
        keys: CFArrayRef,
        patterns: CFArrayRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCDynamicStoreCopyNotifiedKeys(store: SCDynamicStoreRef) -> CFArrayRef;
}
