/* automatically generated by rust-bindgen */

// Generated using:
// bindgen 0.51.0
// macOS SDK 10.14.

use core_foundation_sys::array::CFArrayRef;
use core_foundation_sys::base::{Boolean, CFAllocatorRef, CFIndex, CFTypeID};
use core_foundation_sys::dictionary::CFDictionaryRef;
use core_foundation_sys::runloop::CFRunLoopRef;
use core_foundation_sys::string::CFStringRef;

use dispatch_queue_t;
use libc::{c_void, sockaddr, socklen_t};
use preferences::SCPreferencesRef;

pub type __SCNetworkReachability = c_void;
pub type __SCNetworkConnection = c_void;
pub type __SCNetworkInterface = c_void;
pub type __SCBondStatus = c_void;
pub type __SCNetworkProtocol = c_void;
pub type __SCNetworkService = c_void;
pub type __SCNetworkSet = c_void;

pub type SCNetworkConnectionFlags = u32;
extern "C" {
    pub fn SCNetworkCheckReachabilityByAddress(
        address: *const sockaddr,
        addrlen: socklen_t,
        flags: *mut SCNetworkConnectionFlags,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkCheckReachabilityByName(
        nodename: *const ::libc::c_char,
        flags: *mut SCNetworkConnectionFlags,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkInterfaceRefreshConfiguration(ifName: CFStringRef) -> Boolean;
}
pub type SCNetworkReachabilityRef = *const __SCNetworkReachability;
#[repr(C)]
pub struct SCNetworkReachabilityContext {
    pub version: CFIndex,
    pub info: *mut ::libc::c_void,
    pub retain: ::core::option::Option<
        unsafe extern "C" fn(info: *const ::libc::c_void) -> *const ::libc::c_void,
    >,
    pub release: ::core::option::Option<unsafe extern "C" fn(info: *const ::libc::c_void)>,
    pub copyDescription:
        ::core::option::Option<unsafe extern "C" fn(info: *const ::libc::c_void) -> CFStringRef>,
}
#[test]
fn bindgen_test_layout_SCNetworkReachabilityContext() {
    assert_eq!(
        ::core::mem::size_of::<SCNetworkReachabilityContext>(),
        40usize,
        concat!("Size of: ", stringify!(SCNetworkReachabilityContext))
    );
    assert_eq!(
        ::core::mem::align_of::<SCNetworkReachabilityContext>(),
        8usize,
        concat!("Alignment of ", stringify!(SCNetworkReachabilityContext))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SCNetworkReachabilityContext>())).version as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCNetworkReachabilityContext),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SCNetworkReachabilityContext>())).info as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SCNetworkReachabilityContext),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SCNetworkReachabilityContext>())).retain as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SCNetworkReachabilityContext),
            "::",
            stringify!(retain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SCNetworkReachabilityContext>())).release as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SCNetworkReachabilityContext),
            "::",
            stringify!(release)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SCNetworkReachabilityContext>())).copyDescription as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SCNetworkReachabilityContext),
            "::",
            stringify!(copyDescription)
        )
    );
}
pub type SCNetworkReachabilityFlags = u32;
pub type SCNetworkReachabilityCallBack = ::core::option::Option<
    unsafe extern "C" fn(
        target: SCNetworkReachabilityRef,
        flags: SCNetworkReachabilityFlags,
        info: *mut ::libc::c_void,
    ),
>;
extern "C" {
    pub fn SCNetworkReachabilityCreateWithAddress(
        allocator: CFAllocatorRef,
        address: *const sockaddr,
    ) -> SCNetworkReachabilityRef;
}
extern "C" {
    pub fn SCNetworkReachabilityCreateWithAddressPair(
        allocator: CFAllocatorRef,
        localAddress: *const sockaddr,
        remoteAddress: *const sockaddr,
    ) -> SCNetworkReachabilityRef;
}
extern "C" {
    pub fn SCNetworkReachabilityCreateWithName(
        allocator: CFAllocatorRef,
        nodename: *const ::libc::c_char,
    ) -> SCNetworkReachabilityRef;
}
extern "C" {
    pub fn SCNetworkReachabilityGetTypeID() -> CFTypeID;
}
extern "C" {
    pub fn SCNetworkReachabilityGetFlags(
        target: SCNetworkReachabilityRef,
        flags: *mut SCNetworkReachabilityFlags,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkReachabilitySetCallback(
        target: SCNetworkReachabilityRef,
        callout: SCNetworkReachabilityCallBack,
        context: *mut SCNetworkReachabilityContext,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkReachabilityScheduleWithRunLoop(
        target: SCNetworkReachabilityRef,
        runLoop: CFRunLoopRef,
        runLoopMode: CFStringRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkReachabilityUnscheduleFromRunLoop(
        target: SCNetworkReachabilityRef,
        runLoop: CFRunLoopRef,
        runLoopMode: CFStringRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkReachabilitySetDispatchQueue(
        target: SCNetworkReachabilityRef,
        queue: dispatch_queue_t,
    ) -> Boolean;
}
pub type SCNetworkConnectionRef = *const __SCNetworkConnection;
#[repr(C)]
pub struct SCNetworkConnectionContext {
    pub version: CFIndex,
    pub info: *mut ::libc::c_void,
    pub retain: ::core::option::Option<
        unsafe extern "C" fn(info: *const ::libc::c_void) -> *const ::libc::c_void,
    >,
    pub release: ::core::option::Option<unsafe extern "C" fn(info: *const ::libc::c_void)>,
    pub copyDescription:
        ::core::option::Option<unsafe extern "C" fn(info: *const ::libc::c_void) -> CFStringRef>,
}
#[test]
fn bindgen_test_layout_SCNetworkConnectionContext() {
    assert_eq!(
        ::core::mem::size_of::<SCNetworkConnectionContext>(),
        40usize,
        concat!("Size of: ", stringify!(SCNetworkConnectionContext))
    );
    assert_eq!(
        ::core::mem::align_of::<SCNetworkConnectionContext>(),
        8usize,
        concat!("Alignment of ", stringify!(SCNetworkConnectionContext))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SCNetworkConnectionContext>())).version as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCNetworkConnectionContext),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SCNetworkConnectionContext>())).info as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SCNetworkConnectionContext),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SCNetworkConnectionContext>())).retain as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SCNetworkConnectionContext),
            "::",
            stringify!(retain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SCNetworkConnectionContext>())).release as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SCNetworkConnectionContext),
            "::",
            stringify!(release)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SCNetworkConnectionContext>())).copyDescription as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SCNetworkConnectionContext),
            "::",
            stringify!(copyDescription)
        )
    );
}
pub type SCNetworkConnectionStatus = i32;
pub type SCNetworkConnectionCallBack = ::core::option::Option<
    unsafe extern "C" fn(
        connection: SCNetworkConnectionRef,
        status: SCNetworkConnectionStatus,
        info: *mut ::libc::c_void,
    ),
>;
extern "C" {
    pub fn SCNetworkConnectionGetTypeID() -> CFTypeID;
}
extern "C" {
    pub fn SCNetworkConnectionCopyUserPreferences(
        selectionOptions: CFDictionaryRef,
        serviceID: *mut CFStringRef,
        userOptions: *mut CFDictionaryRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkConnectionCreateWithServiceID(
        allocator: CFAllocatorRef,
        serviceID: CFStringRef,
        callout: SCNetworkConnectionCallBack,
        context: *mut SCNetworkConnectionContext,
    ) -> SCNetworkConnectionRef;
}
extern "C" {
    pub fn SCNetworkConnectionCopyServiceID(connection: SCNetworkConnectionRef) -> CFStringRef;
}
extern "C" {
    pub fn SCNetworkConnectionGetStatus(
        connection: SCNetworkConnectionRef,
    ) -> SCNetworkConnectionStatus;
}
extern "C" {
    pub fn SCNetworkConnectionCopyExtendedStatus(
        connection: SCNetworkConnectionRef,
    ) -> CFDictionaryRef;
}
extern "C" {
    pub fn SCNetworkConnectionCopyStatistics(connection: SCNetworkConnectionRef)
        -> CFDictionaryRef;
}
extern "C" {
    pub fn SCNetworkConnectionStart(
        connection: SCNetworkConnectionRef,
        userOptions: CFDictionaryRef,
        linger: Boolean,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkConnectionStop(
        connection: SCNetworkConnectionRef,
        forceDisconnect: Boolean,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkConnectionCopyUserOptions(
        connection: SCNetworkConnectionRef,
    ) -> CFDictionaryRef;
}
extern "C" {
    pub fn SCNetworkConnectionScheduleWithRunLoop(
        connection: SCNetworkConnectionRef,
        runLoop: CFRunLoopRef,
        runLoopMode: CFStringRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkConnectionUnscheduleFromRunLoop(
        connection: SCNetworkConnectionRef,
        runLoop: CFRunLoopRef,
        runLoopMode: CFStringRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkConnectionSetDispatchQueue(
        connection: SCNetworkConnectionRef,
        queue: dispatch_queue_t,
    ) -> Boolean;
}
pub type SCNetworkInterfaceRef = *const __SCNetworkInterface;
extern "C" {
    pub static kSCNetworkInterfaceType6to4: CFStringRef;
}
extern "C" {
    pub static kSCNetworkInterfaceTypeBluetooth: CFStringRef;
}
extern "C" {
    pub static kSCNetworkInterfaceTypeBond: CFStringRef;
}
extern "C" {
    pub static kSCNetworkInterfaceTypeEthernet: CFStringRef;
}
extern "C" {
    pub static kSCNetworkInterfaceTypeFireWire: CFStringRef;
}
extern "C" {
    pub static kSCNetworkInterfaceTypeIEEE80211: CFStringRef;
}
extern "C" {
    pub static kSCNetworkInterfaceTypeIPSec: CFStringRef;
}
extern "C" {
    pub static kSCNetworkInterfaceTypeIrDA: CFStringRef;
}
extern "C" {
    pub static kSCNetworkInterfaceTypeL2TP: CFStringRef;
}
extern "C" {
    pub static kSCNetworkInterfaceTypeModem: CFStringRef;
}
extern "C" {
    pub static kSCNetworkInterfaceTypePPP: CFStringRef;
}
extern "C" {
    pub static kSCNetworkInterfaceTypePPTP: CFStringRef;
}
extern "C" {
    pub static kSCNetworkInterfaceTypeSerial: CFStringRef;
}
extern "C" {
    pub static kSCNetworkInterfaceTypeVLAN: CFStringRef;
}
extern "C" {
    pub static kSCNetworkInterfaceTypeWWAN: CFStringRef;
}
extern "C" {
    pub static kSCNetworkInterfaceTypeIPv4: CFStringRef;
}
extern "C" {
    pub static kSCNetworkInterfaceIPv4: SCNetworkInterfaceRef;
}
pub type SCBondInterfaceRef = SCNetworkInterfaceRef;
pub type SCBondStatusRef = *const __SCBondStatus;
pub const kSCBondStatusOK: _bindgen_ty_285 = 0;
pub const kSCBondStatusLinkInvalid: _bindgen_ty_285 = 1;
pub const kSCBondStatusNoPartner: _bindgen_ty_285 = 2;
pub const kSCBondStatusNotInActiveGroup: _bindgen_ty_285 = 3;
pub const kSCBondStatusUnknown: _bindgen_ty_285 = 999;
pub type _bindgen_ty_285 = u32;
extern "C" {
    pub static kSCBondStatusDeviceAggregationStatus: CFStringRef;
}
extern "C" {
    pub static kSCBondStatusDeviceCollecting: CFStringRef;
}
extern "C" {
    pub static kSCBondStatusDeviceDistributing: CFStringRef;
}
pub type SCNetworkProtocolRef = *const __SCNetworkProtocol;
pub type SCNetworkServiceRef = *const __SCNetworkService;
pub type SCNetworkSetRef = *const __SCNetworkSet;
extern "C" {
    pub fn SCNetworkInterfaceGetTypeID() -> CFTypeID;
}
extern "C" {
    pub fn SCNetworkInterfaceCopyAll() -> CFArrayRef;
}
extern "C" {
    pub fn SCNetworkInterfaceGetSupportedInterfaceTypes(
        interface: SCNetworkInterfaceRef,
    ) -> CFArrayRef;
}
extern "C" {
    pub fn SCNetworkInterfaceGetSupportedProtocolTypes(
        interface: SCNetworkInterfaceRef,
    ) -> CFArrayRef;
}
extern "C" {
    pub fn SCNetworkInterfaceCreateWithInterface(
        interface: SCNetworkInterfaceRef,
        interfaceType: CFStringRef,
    ) -> SCNetworkInterfaceRef;
}
extern "C" {
    pub fn SCNetworkInterfaceGetBSDName(interface: SCNetworkInterfaceRef) -> CFStringRef;
}
extern "C" {
    pub fn SCNetworkInterfaceGetConfiguration(interface: SCNetworkInterfaceRef) -> CFDictionaryRef;
}
extern "C" {
    pub fn SCNetworkInterfaceGetExtendedConfiguration(
        interface: SCNetworkInterfaceRef,
        extendedType: CFStringRef,
    ) -> CFDictionaryRef;
}
extern "C" {
    pub fn SCNetworkInterfaceGetHardwareAddressString(
        interface: SCNetworkInterfaceRef,
    ) -> CFStringRef;
}
extern "C" {
    pub fn SCNetworkInterfaceGetInterface(
        interface: SCNetworkInterfaceRef,
    ) -> SCNetworkInterfaceRef;
}
extern "C" {
    pub fn SCNetworkInterfaceGetInterfaceType(interface: SCNetworkInterfaceRef) -> CFStringRef;
}
extern "C" {
    pub fn SCNetworkInterfaceGetLocalizedDisplayName(
        interface: SCNetworkInterfaceRef,
    ) -> CFStringRef;
}
extern "C" {
    pub fn SCNetworkInterfaceSetConfiguration(
        interface: SCNetworkInterfaceRef,
        config: CFDictionaryRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkInterfaceSetExtendedConfiguration(
        interface: SCNetworkInterfaceRef,
        extendedType: CFStringRef,
        config: CFDictionaryRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkInterfaceCopyMediaOptions(
        interface: SCNetworkInterfaceRef,
        current: *mut CFDictionaryRef,
        active: *mut CFDictionaryRef,
        available: *mut CFArrayRef,
        filter: Boolean,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkInterfaceCopyMediaSubTypes(available: CFArrayRef) -> CFArrayRef;
}
extern "C" {
    pub fn SCNetworkInterfaceCopyMediaSubTypeOptions(
        available: CFArrayRef,
        subType: CFStringRef,
    ) -> CFArrayRef;
}
extern "C" {
    pub fn SCNetworkInterfaceCopyMTU(
        interface: SCNetworkInterfaceRef,
        mtu_cur: *mut ::libc::c_int,
        mtu_min: *mut ::libc::c_int,
        mtu_max: *mut ::libc::c_int,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkInterfaceSetMediaOptions(
        interface: SCNetworkInterfaceRef,
        subtype: CFStringRef,
        options: CFArrayRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkInterfaceSetMTU(
        interface: SCNetworkInterfaceRef,
        mtu: ::libc::c_int,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkInterfaceForceConfigurationRefresh(interface: SCNetworkInterfaceRef)
        -> Boolean;
}
extern "C" {
    pub fn SCBondInterfaceCopyAll(prefs: SCPreferencesRef) -> CFArrayRef;
}
extern "C" {
    pub fn SCBondInterfaceCopyAvailableMemberInterfaces(prefs: SCPreferencesRef) -> CFArrayRef;
}
extern "C" {
    pub fn SCBondInterfaceCreate(prefs: SCPreferencesRef) -> SCBondInterfaceRef;
}
extern "C" {
    pub fn SCBondInterfaceRemove(bond: SCBondInterfaceRef) -> Boolean;
}
extern "C" {
    pub fn SCBondInterfaceGetMemberInterfaces(bond: SCBondInterfaceRef) -> CFArrayRef;
}
extern "C" {
    pub fn SCBondInterfaceGetOptions(bond: SCBondInterfaceRef) -> CFDictionaryRef;
}
extern "C" {
    pub fn SCBondInterfaceSetMemberInterfaces(
        bond: SCBondInterfaceRef,
        members: CFArrayRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCBondInterfaceSetLocalizedDisplayName(
        bond: SCBondInterfaceRef,
        newName: CFStringRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCBondInterfaceSetOptions(
        bond: SCBondInterfaceRef,
        newOptions: CFDictionaryRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCBondInterfaceCopyStatus(bond: SCBondInterfaceRef) -> SCBondStatusRef;
}
extern "C" {
    pub fn SCNetworkProtocolGetTypeID() -> CFTypeID;
}
extern "C" {
    pub fn SCNetworkProtocolGetConfiguration(protocol: SCNetworkProtocolRef) -> CFDictionaryRef;
}
extern "C" {
    pub fn SCNetworkProtocolGetEnabled(protocol: SCNetworkProtocolRef) -> Boolean;
}
extern "C" {
    pub fn SCNetworkProtocolGetProtocolType(protocol: SCNetworkProtocolRef) -> CFStringRef;
}
extern "C" {
    pub fn SCNetworkProtocolSetConfiguration(
        protocol: SCNetworkProtocolRef,
        config: CFDictionaryRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkProtocolSetEnabled(protocol: SCNetworkProtocolRef, enabled: Boolean)
        -> Boolean;
}
extern "C" {
    pub fn SCNetworkServiceGetTypeID() -> CFTypeID;
}
extern "C" {
    pub fn SCNetworkServiceAddProtocolType(
        service: SCNetworkServiceRef,
        protocolType: CFStringRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkServiceCopyAll(prefs: SCPreferencesRef) -> CFArrayRef;
}
extern "C" {
    pub fn SCNetworkServiceCopyProtocols(service: SCNetworkServiceRef) -> CFArrayRef;
}
extern "C" {
    pub fn SCNetworkServiceCreate(
        prefs: SCPreferencesRef,
        interface: SCNetworkInterfaceRef,
    ) -> SCNetworkServiceRef;
}
extern "C" {
    pub fn SCNetworkServiceCopy(
        prefs: SCPreferencesRef,
        serviceID: CFStringRef,
    ) -> SCNetworkServiceRef;
}
extern "C" {
    pub fn SCNetworkServiceEstablishDefaultConfiguration(service: SCNetworkServiceRef) -> Boolean;
}
extern "C" {
    pub fn SCNetworkServiceGetEnabled(service: SCNetworkServiceRef) -> Boolean;
}
extern "C" {
    pub fn SCNetworkServiceGetInterface(service: SCNetworkServiceRef) -> SCNetworkInterfaceRef;
}
extern "C" {
    pub fn SCNetworkServiceGetName(service: SCNetworkServiceRef) -> CFStringRef;
}
extern "C" {
    pub fn SCNetworkServiceCopyProtocol(
        service: SCNetworkServiceRef,
        protocolType: CFStringRef,
    ) -> SCNetworkProtocolRef;
}
extern "C" {
    pub fn SCNetworkServiceGetServiceID(service: SCNetworkServiceRef) -> CFStringRef;
}
extern "C" {
    pub fn SCNetworkServiceRemove(service: SCNetworkServiceRef) -> Boolean;
}
extern "C" {
    pub fn SCNetworkServiceRemoveProtocolType(
        service: SCNetworkServiceRef,
        protocolType: CFStringRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkServiceSetEnabled(service: SCNetworkServiceRef, enabled: Boolean) -> Boolean;
}
extern "C" {
    pub fn SCNetworkServiceSetName(service: SCNetworkServiceRef, name: CFStringRef) -> Boolean;
}
extern "C" {
    pub fn SCNetworkSetGetTypeID() -> CFTypeID;
}
extern "C" {
    pub fn SCNetworkSetAddService(set: SCNetworkSetRef, service: SCNetworkServiceRef) -> Boolean;
}
extern "C" {
    pub fn SCNetworkSetContainsInterface(
        set: SCNetworkSetRef,
        interface: SCNetworkInterfaceRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCNetworkSetCopyAll(prefs: SCPreferencesRef) -> CFArrayRef;
}
extern "C" {
    pub fn SCNetworkSetCopyCurrent(prefs: SCPreferencesRef) -> SCNetworkSetRef;
}
extern "C" {
    pub fn SCNetworkSetCopyServices(set: SCNetworkSetRef) -> CFArrayRef;
}
extern "C" {
    pub fn SCNetworkSetCreate(prefs: SCPreferencesRef) -> SCNetworkSetRef;
}
extern "C" {
    pub fn SCNetworkSetCopy(prefs: SCPreferencesRef, setID: CFStringRef) -> SCNetworkSetRef;
}
extern "C" {
    pub fn SCNetworkSetGetName(set: SCNetworkSetRef) -> CFStringRef;
}
extern "C" {
    pub fn SCNetworkSetGetSetID(set: SCNetworkSetRef) -> CFStringRef;
}
extern "C" {
    pub fn SCNetworkSetGetServiceOrder(set: SCNetworkSetRef) -> CFArrayRef;
}
extern "C" {
    pub fn SCNetworkSetRemove(set: SCNetworkSetRef) -> Boolean;
}
extern "C" {
    pub fn SCNetworkSetRemoveService(set: SCNetworkSetRef, service: SCNetworkServiceRef)
        -> Boolean;
}
extern "C" {
    pub fn SCNetworkSetSetCurrent(set: SCNetworkSetRef) -> Boolean;
}
extern "C" {
    pub fn SCNetworkSetSetName(set: SCNetworkSetRef, name: CFStringRef) -> Boolean;
}
extern "C" {
    pub fn SCNetworkSetSetServiceOrder(set: SCNetworkSetRef, newOrder: CFArrayRef) -> Boolean;
}
