/* automatically generated by rust-bindgen */

// Generated using:
// bindgen 0.51.0
// macOS SDK 10.14.

use core_foundation_sys::array::CFArrayRef;
use core_foundation_sys::base::{Boolean, CFAllocatorRef, CFIndex, CFTypeID};
use core_foundation_sys::data::CFDataRef;
use core_foundation_sys::propertylist::CFPropertyListRef;
use core_foundation_sys::runloop::CFRunLoopRef;
use core_foundation_sys::string::CFStringRef;

use dispatch_queue_t;
use libc::c_void;

pub type AuthorizationOpaqueRef = c_void;
pub type __SCPreferences = c_void;

pub type AuthorizationRef = *const AuthorizationOpaqueRef;
pub type SCPreferencesRef = *const __SCPreferences;
pub type SCPreferencesNotification = u32;
#[repr(C)]
pub struct SCPreferencesContext {
    pub version: CFIndex,
    pub info: *mut ::libc::c_void,
    pub retain: ::core::option::Option<
        unsafe extern "C" fn(info: *const ::libc::c_void) -> *const ::libc::c_void,
    >,
    pub release: ::core::option::Option<unsafe extern "C" fn(info: *const ::libc::c_void)>,
    pub copyDescription:
        ::core::option::Option<unsafe extern "C" fn(info: *const ::libc::c_void) -> CFStringRef>,
}
#[test]
fn bindgen_test_layout_SCPreferencesContext() {
    assert_eq!(
        ::core::mem::size_of::<SCPreferencesContext>(),
        40usize,
        concat!("Size of: ", stringify!(SCPreferencesContext))
    );
    assert_eq!(
        ::core::mem::align_of::<SCPreferencesContext>(),
        8usize,
        concat!("Alignment of ", stringify!(SCPreferencesContext))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCPreferencesContext>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SCPreferencesContext),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCPreferencesContext>())).info as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SCPreferencesContext),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCPreferencesContext>())).retain as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SCPreferencesContext),
            "::",
            stringify!(retain)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<SCPreferencesContext>())).release as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SCPreferencesContext),
            "::",
            stringify!(release)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<SCPreferencesContext>())).copyDescription as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SCPreferencesContext),
            "::",
            stringify!(copyDescription)
        )
    );
}
pub type SCPreferencesCallBack = ::core::option::Option<
    unsafe extern "C" fn(
        prefs: SCPreferencesRef,
        notificationType: SCPreferencesNotification,
        info: *mut ::libc::c_void,
    ),
>;
extern "C" {
    pub fn SCPreferencesGetTypeID() -> CFTypeID;
}
extern "C" {
    pub fn SCPreferencesCreate(
        allocator: CFAllocatorRef,
        name: CFStringRef,
        prefsID: CFStringRef,
    ) -> SCPreferencesRef;
}
extern "C" {
    pub fn SCPreferencesCreateWithAuthorization(
        allocator: CFAllocatorRef,
        name: CFStringRef,
        prefsID: CFStringRef,
        authorization: AuthorizationRef,
    ) -> SCPreferencesRef;
}
extern "C" {
    pub fn SCPreferencesLock(prefs: SCPreferencesRef, wait: Boolean) -> Boolean;
}
extern "C" {
    pub fn SCPreferencesCommitChanges(prefs: SCPreferencesRef) -> Boolean;
}
extern "C" {
    pub fn SCPreferencesApplyChanges(prefs: SCPreferencesRef) -> Boolean;
}
extern "C" {
    pub fn SCPreferencesUnlock(prefs: SCPreferencesRef) -> Boolean;
}
extern "C" {
    pub fn SCPreferencesGetSignature(prefs: SCPreferencesRef) -> CFDataRef;
}
extern "C" {
    pub fn SCPreferencesCopyKeyList(prefs: SCPreferencesRef) -> CFArrayRef;
}
extern "C" {
    pub fn SCPreferencesGetValue(prefs: SCPreferencesRef, key: CFStringRef) -> CFPropertyListRef;
}
extern "C" {
    pub fn SCPreferencesAddValue(
        prefs: SCPreferencesRef,
        key: CFStringRef,
        value: CFPropertyListRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCPreferencesSetValue(
        prefs: SCPreferencesRef,
        key: CFStringRef,
        value: CFPropertyListRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCPreferencesRemoveValue(prefs: SCPreferencesRef, key: CFStringRef) -> Boolean;
}
extern "C" {
    pub fn SCPreferencesSetCallback(
        prefs: SCPreferencesRef,
        callout: SCPreferencesCallBack,
        context: *mut SCPreferencesContext,
    ) -> Boolean;
}
extern "C" {
    pub fn SCPreferencesScheduleWithRunLoop(
        prefs: SCPreferencesRef,
        runLoop: CFRunLoopRef,
        runLoopMode: CFStringRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCPreferencesUnscheduleFromRunLoop(
        prefs: SCPreferencesRef,
        runLoop: CFRunLoopRef,
        runLoopMode: CFStringRef,
    ) -> Boolean;
}
extern "C" {
    pub fn SCPreferencesSetDispatchQueue(
        prefs: SCPreferencesRef,
        queue: dispatch_queue_t,
    ) -> Boolean;
}
extern "C" {
    pub fn SCPreferencesSynchronize(prefs: SCPreferencesRef);
}
